import { Province } from '../types/types.ts';

export const PROVINCES_BY_REGION: Record<string, string[]> = {
  'ภาคเหนือ': [
    'เชียงราย', 'เชียงใหม่', 'น่าน', 'พะเยา', 'แพร่', 'แม่ฮ่องสอน', 'ลำปาง', 'ลำพูน', 'อุตรดิตถ์'
  ],
  'ภาคตะวันออกเฉียงเหนือ': [
    'กาฬสินธุ์', 'ขอนแก่น', 'ชัยภูมิ', 'นครพนม', 'นครราชสีมา', 'บึงกาฬ', 'บุรีรัมย์', 'มหาสารคาม', 'มุกดาหาร', 'ยโสธร', 'ร้อยเอ็ด', 'เลย', 'สกลนคร', 'สุรินทร์', 'ศรีสะเกษ', 'หนองคาย', 'หนองบัวลำภู', 'อุดรธานี', 'อุบลราชธานี', 'อำนาจเจริญ'
  ],
  'ภาคกลาง': [
    'กรุงเทพมหานคร', 'กำแพงเพชร', 'ชัยนาท', 'นครนายก', 'นครปฐม', 'นครสวรรค์', 'นนทบุรี', 'ปทุมธานี', 'พระนครศรีอยุธยา', 'พิจิตร', 'พิษณุโลก', 'เพชรบูรณ์', 'ลพบุรี', 'สมุทรปราการ', 'สมุทรสงคราม', 'สมุทรสาคร', 'สระบุรี', 'สิงห์บุรี', 'สุโขทัย', 'สุพรรณบุรี', 'อ่างทอง', 'อุทัยธานี'
  ],
  'ภาคตะวันออก': [
    'จันทบุรี', 'ฉะเชิงเทรา', 'ชลบุรี', 'ตราด', 'ปราจีนบุรี', 'ระยอง', 'สระแก้ว'
  ],
  'ภาคตะวันตก': [
    'กาญจนบุรี', 'ตาก', 'ประจวบคีรีขันธ์', 'เพชรบุรี', 'ราชบุรี'
  ],
  'ภาคใต้': [
    'กระบี่', 'ชุมพร', 'ตรัง', 'นครศรีธรรมราช', 'นราธิวาส', 'ปัตตานี', 'พังงา', 'พัทลุง', 'ภูเก็ต', 'ระนอง', 'สตูล', 'สงขลา', 'สุราษฎร์ธานี', 'ยะลา'
  ]
};

export const DISTRICTS: Record<Province, string[]> = {
  [Province.ChiangMai]: [
    'เมืองเชียงใหม่', 'จอมทอง', 'เชียงดาว', 'ดอยสะเก็ด', 'ดอยหล่อ',
    'ฝาง', 'พร้าว', 'แม่แจ่ม', 'แม่แตง', 'แม่ริม', 'แม่ออน',
    'แม่อาย', 'เวียงแหง', 'สะเมิง', 'สันกำแพง', 'สันทราย',
    'สันป่าตอง', 'สารภี', 'หางดง', 'อมก๋อย', 'ฮอด', 'ไชยปราการ',
    'กัลยาณิวัฒนา', 'ดอยเต่า', 'แม่วาง'
  ],
  [Province.Bangkok]: [
    'พระนคร', 'ดุสิต', 'หนองจอก', 'บางรัก', 'บางเขน',
    'บางกะปิ', 'ปทุมวัน', 'ป้อมปราบศัตรูพ่าย', 'พระโขนง', 'มีนบุรี',
    'ลาดกระบัง', 'ยานนาวา', 'สัมพันธวงศ์', 'พญาไท', 'ธนบุรี',
    'บางกอกใหญ่', 'ห้วยขวาง', 'คลองสาน', 'ตลิ่งชัน', 'บางกอกน้อย',
    'บางขุนเทียน', 'ภาษีเจริญ', 'หนองแขม', 'ราษฎร์บูรณะ', 'บางพลัด',
    'ดินแดง', 'บึงกุ่ม', 'สาทร', 'บางซื่อ', 'จตุจักร', 'บางคอแหลม',
    'ประเวศ', 'คลองเตย', 'สวนหลวง', 'จอมทอง', 'ดอนเมือง', 'ราชเทวี',
    'ลาดพร้าว', 'วัฒนา', 'บางแค', 'หลักสี่', 'สายไหม', 'คันนายาว',
    'สะพานสูง', 'วังทองหลาง', 'คลองสามวา', 'บางนา', 'ทวีวัฒนา',
    'ทุ่งครุ', 'บางบอน'
  ]
};